[
    {
        "name": "HONOURABLE THE CHIEF JUSTICE ALOK ARADHE",
        "description": "Born on 13.04.1964 at Raipur, B.Sc and LLB. Enrolled as Advocate on July 12, 1988. Practiced on Civil and Constitutional, Arbitration and Company matters in the High Court of Madhya Pradesh at Jabalpur. Designated as Senior Advocate in April, 2007. Revised the 5th and 6th Editions of Principles of Administrative Law by M.P.Jain and S.N.Jain and 15th Edition of Principles of Statutory Interpretation by late Honourable Justice G.P.Singh, Former Chief Justice of High Court of Madhya Pradesh.Appointed as Additional Judge of the High Court of Madhya Pradesh on December, 29, 2009 and Permanent Judge on February 15th, 2011. Transferred to High Court of Jammu and Kashmir and took oath as such on 20.09.2016. Nominated as Chairman of Jammu and Kashmir State Judicial Academy on 07.06.2017. Appointed as Acting Chief Justice of High Court of Jammu and Kashmir on 11.05.2018 and functioned as such upto 10.08.2018. Nominated as Executive Chairman of Jammu and Kashmir State Legal Services Authority on 04.09.2018. On transfer to Karnataka High Court, His Lordship took oath as Judge of Karnataka High Court on 17.11.2018. His Lordship assumed charge as the Acting Chief Justice of Karnataka High Court on 03.07.2022 and functioned as such upto 14.10.2022. Served as President of Bangalore Mediation Centre, Arbitration and Conciliation Centre and President of Karnataka Judicial Academy. Appointed as Chief Justice, High Court for the State of Telangana on 19.07.2023 and took oath of office on 23.07.2023. ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1041"
    },
    {
        "name": "HONOURABLE SRI JUSTICE P. SAM KOSHY",
        "description": "Born on April 30, 1967. Took Bachelors Degree in Commerce in 1987 and Law degree in 1990. Enrolled as an Advocate on March 9, 1991.Practiced on Civil, Constitutional and Service and  Labour matters initially in the High Court of Madhya Pradesh at Jabalpur till October, 2000 and subsequently in the High Court of Chhattisgarh at Bilaspur from November, 2000 till September, 2013. Was Government Advocate at the High Court of Chhattisgarh from 2002 to 2004. Also was Deputy Advocate General in 2005-06. Earlier was a member of the Academic Council of Hidayatulla National Law University, Raipur. At present, is a member of the General Council Hidayatulla National Law University, Raipur. Was a counsel for various Public Sectors undertakings, Banks as well as many private institutions like, South East Central Railway, Coal India Limited, South Eastern Coalfields Limited, National Mineral Development Corporation, State Bank of India, Indian Oil Corporation Limited, Hindustan Petroleum Corporation Limited, Bharat Petroleum Corporation Limited, Madhya Pradesh Electricity Board, Chhattisgarh State Electricity Board etc., etc. Appointed as Additional Judge of the High Court of Chhattisgarh on September 16, 2013. Later, assumed charge as the permanent Judge of the High Court of Chattisgarh on 08.03.2016. On transfer to High Court for the State of Telangana, His Lordship took oath as Judge of High Court for the State of Telangana on 27.07.2023.",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1042"
    },
    {
        "name": "HONOURABLE SRI JUSTICE ABHINAND KUMAR SHAVILI",
        "description": "Honourable Sri Justice Abhinand Kumar Shavili was born on 08.10.1963 to late Dr. Subba Rao Shavili and late Smt. Sangam Yashoda Shavili. Had School education from St. Johns Grammar School, Secunderabad, Intermediate from Nrupatunga Junior College, Hyderabad, B.Sc., Degree from Nizam College (Osmania University, Hyderabad), and LL.B., from Osmania University Campus Law College.Enrolled as an Advocate on 31.08.1989 in the Bar Council of Andhra Pradesh. Initially joined the Chambers of Sri D. Linga Rao, Advocate, and later the Office of former Justice Nooty Rama Mohana Rao when His Lordship was practicing as an Advocate, on 02.02.1993, and gained exposure to various branches of law. Actively practiced in Service Law, Constitutional Law, and other branches of Law, and was also standing counsel for the High Court of Judicature at Hyderabad for the State of Telangana and the State of Andhra Pradesh.Elevated as Judge of the High Court of Judicature at Hyderabad for the State of Telangana and the State of Andhra Pradesh on 21.09.2017.Appointed to perform the duties of office of the Chief Justice of High Court for the State of Telangana w.e.f. 15.07.2023  to 23.07.2023",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=160"
    },
    {
        "name": "HONOURABLE SRI JUSTICE T. VINOD KUMAR",
        "description": "Born on 17th November, 1964 to late Sri T. Laxmi Narasimha Rao and Smt. T. Shakuntala. Had initial school education at Suryapet in Nalgonda District and thereafter in Hyderabad. Obtained Bachelor of Arts degree and LL.B., from Osmania University.Enrolled as an Advocate in the year 1988 in the Bar Council of Andhra Pradesh and joined in the chambers of Sri Ravi. S, Senior Advocate. Specialized in Tax and Corporate Litigation. Appointed as Senior Standing Counsel for Income Tax in 2015 and as Special Standing Counsel for Commercial Tax in 2016 and continued till elevation.Appointed as Judge of the High Court for the State of Telangana, Hyderabad and sworn-in on 26th August, 2019.",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1007"
    },
    {
        "name": "HONOURABLE SRI JUSTICE K.LAKSHMAN",
        "description": " He was born on 08.06.1966 to Sri K. Gopal and Smt. K. Sathamma, who hail from an agriculture family. Of the five children (two sons and three daughters), he is the second one and the eldest son. He belongs to Bogaram village of Ramannapet Mandal in Yadadri - Bhuvanagiri District. His school journey had taken place in Government Schools at Bogaram and Ramannapet villages respectively. He did his Graduation with B.Sc., (M.P.C.) from New Science Degree College, Ameerpet, Hyderabad, and later did his LL.B., from V.R. Law College, Nellore of Sri Venkateshwara University.After completion of Law Degree, he enrolled as an Advocate in the year 1993 with the Andhra Pradesh Bar Council and joined in the office of Sri Madiraju Radhakrishna Murthy, Advocate and did his juniorship for some time in the erstwhile High Court of Andhra Pradesh and various other Subordinate Courts in and around the twin cities and thereafter started his independent practice from 1999 on the side of Civil Law, Constitutional Law and Cooperative Laws. He was also Standing Counsel for Uranium Corporation of India and various private reputed Institutions or Companies.He got married to A. Manjula Rani. He was blessed with two daughters, Ms. Sreeja and Ms. Himaja.He was appointed as an Assistant Solicitor General of India for the High Court of Judicature at Hyderabad for the States of Telangana and Andhra Pradesh on 24th August, 2017, and after bifurcation of the High Court, served as such for the High Court of Telangana State and discharged his duties till his elevation as a Judge of the Honourable High Court.He has been elevated as a Judge for the High Court of State Telangana and was sworn-in as such in the forenoon of Monday, 26th of August 2019. ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1009"
    },
    {
        "name": "HONOURABLE SRI JUSTICE B.VIJAYSEN REDDY",
        "description": "Born on 22.08.1970 at Hyderabad. His father Justice B. Subhashan Reddy (Late) was a former Chief Justice of Madras and Kerala High Courts and was also former Chairperson of A.P. State Human Rights Commission and former Lokayukta for the States of Andhra Pradesh and Telangana. His grand father Sri B. Aga Reddy (Late) was renowned personality and was a former Examiner of Accounts Jagir Administration in the erstwhile Hyderabad State. He passed LL.B., from Padala Rama Reddy Law College (Osmania University) Hyderabad in 1994. He enrolled as an Advocate on 28.12.1994. As an advocate Justice Reddy practiced in all branches of Law and appeared in High Court in large number of Constitutional, Civil, Revenue and Criminal matters. He practiced as a private lawyer for more than 25 years and commanded good practice in Revenue Laws, Land Ceiling, Tenancy, Land Acquisition Laws, other local laws and also on civil and criminal original side and appellate side and appeared regularly in Hyderabad City and Ranga Reddy District civil, Revenue and criminal Courts. He also appeared for several religious, charitable and social organizations. He has number of reported cases to his credit. He was elevated as a permanent Judge of the High Court for the State of Telangana and assumed charge on 02.05.2020. He delivered lectures on Record of Rights and Comparative Study of Old and New Land Acquisition Acts (Young Lawyers Association, A.P. High Court), Litigation Practice, Land Reforms, Civil Procedure Code (NALSAR University), Working of Constitution (Ranga Reddy District Bar Assocation). ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1010"
    },
    {
        "name": "HONOURABLE SMT. JUSTICE P. SREE SUDHA",
        "description": "Born to Sri Venkateswarlu and Smt. Padmavathi as their eldest daughter. Father retired as a Judicial Officer and Mother is a home maker. Did her schooling in Adoni, Kurnool District, and intermediate in Kurnool. Graduated in Pulivendula of Kadapa District. Secured Law Degree from A.C. College of Law, Guntur. Enrolled as a member on the rolls of Bar Council of Andhra Pradesh and did practice at Tenali, Srikalahasti and Kavali respectively. Got married to Dr. P. Srikanth Babu, now Principal, BRKR Government Ayurvedic Government Medical College, Hyderabad. Selected as Direct Recruit District Judge and inducted on 21.08.2002 and completed 19 years of service as I Additional District and Sessions Judge, Nizamabad, Special Judge for Bomb Blast Cases-cum-Additional Judge for Family Court, Hyderabad, Chairperson for Land Appellate Tribunal-cum-II Additional District Judge, Hyderabad, Industrial Tribunal for Warangal and Khammam Districts, Judge, Mahila Court, Metropolitan Sessions Judge at Vijayawada, as Principal District and Sessions Judge at Karimnagar, Visakhapatnam, Nizamabad and as Chief Judge, City Civil Court, Hyderabad, Special Judge for ACB Cases, Hyderabad, Chairperson, VAT Appellate Tribunal, Transport Appellate Tribunal and as Director, Judicial Academy, Secunderabad, and gained commendable exposure in various branches of law. Elevated to the Bench as Permanent Judge, High Court for the State of Telangana and assumed charge as such on 15.10.2021. ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=3208"
    },
    {
        "name": "HONOURABLE DR. JUSTICE G. RADHA RANI",
        "description": "Born on 29th June 1963 at Tenali, Guntur District, to late Smt. Bharata Rajeswari and late Sri Seetha Ramaiah.  Studied Matriculation from Andhra University, Visakhapatnam, Intermediate and B.Sc. (CBZ) from VSR College, Tenali and B.L. from Sir C.R. Reddy Law College, Eluru.  Completed L.L.M. from Osmania University, Hyderabad in 2001.  Obtained P.G. Diploma in Human Rights from Indian Institute of Human Rights, New Delhi and P.G. Diploma in Intellectual Property Rights  from Osmania University, Hyderabad.  Obtained Doctorate in Law on the subject Role of Forensic Investigation in Administration of Criminal Justice in India from Osmania University in the year 2009Married to Sri CLN Gandhi. He retired from State Government Service as Additional Commissioner of Transport. Blessed with two children (1) Mrs.Chetana, Attorney and Legal Consultant and (2) Dr. Mrs.Manavi, MBBS, MD.  Enrolled as Advocate with Bar Council of AP on 10.08.1989 and practiced at Eluru, Vijayawada and High Court, Hyderabad. Appointed by direct recruitment as Assistant Public Prosecutor on 15.06.1998, appointed by direct recruitment as Additional Public Prosecutor Grade-II in 2007, worked as Additional Legal Advisor in Director General, Anti-Corruption Bureau in 2008.  Selected by direct recruitment as District and Sessions Judge (Entry Level) and worked at Ongole, Hyderabad, Sangareddy and Secunderabad.  Worked as Principal District Judge, Nalgonda, Metropolitan Sessions Judge, Hyderabad, Chairperson, Telangana VAT Appellate Tribunal, Hyderabad and worked as Principal District Judge, Ranga Reddy District.  Appointed as Judge of the High Court for the State of Telangana, Hyderabad and assumed charge on 15.10.2021.",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=3215"
    },
    {
        "name": "HONOURABLE SRI JUSTICE N. TUKARAMJI",
        "description": "Studied Secondary School in Andhra Pradesh Residential School, Upper Sileru and Higher Secondary in Andhra Pradesh Residential College, Nagarjuna Sagar. Graduated in five year Law Degree BL Bachelor of Laws from Nyaya Vidya Parishad Law College, Visakhapatnam. Post Graduation LLM Degree from Osmania University and MA in Sociology from Prof. G. Ram Reddy Centre for Distance Education, Osmania University. Joined Bar in 1996 and practiced before the Courts in Ranga Reddy and Hyderabad Districts in Civil and Criminal matters. Joined the Judicial Service as District Judge Entry Level on 26.10.2007 and served as the Chairman, Andhra Pradesh Co-operative Tribunal at Visakhapatnam the Chairman, Land Reforms Appellate Tribunal-cum-II Additional District Judge, West Godavari District at Eluru the III Additional District Judge, East Godavari District at Kakinada the Principal District and Sessions Judge, West Godavari District at Eluru the Principal District and Sessions Judge, East Godavari District at Rajamahendravaram the Metropolitan Sessions Judge, City Criminal Courts, Hyderabad. Elevated as Judge of the High Court for the State of Telangana on 15.10.2021. ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=3217"
    },
    {
        "name": "HONOURABLE SMT. JUSTICE T. MADHAVI DEVI",
        "description": "Was born to Sri Patlolla Raghupathi Reddy and Smt. P. Lakshmi on 28.12.1965 as the first amongst their three daughter. Is married to Sri Tangirala Hanumantha Reddy, Advocate and Member, Telangana State Bar Council and is blessed with two sons.Did her schooling from Kendriya Vidyalaya, Ramagundam and graduation in Commerce in the year 1987 from Sarojini Naidu Vanitha Mahavidyala, Osmania University, Hyderabad. After getting married, she joined Law and secured Law Degree from Siddartha Law College, Gulbarga in the  year 1992. Enrolled as an Advocate on the rolls of the Bar Council of Andhra Pradesh on 20.08.1992. Also secured LL.M. in Constitutional Law from Osmania University, Hyderabad and did Post Graduation Diploma in Alternate Dispute Resolution (ADR) methods from NALSAR University, Hyderabad with distinction in the year 2005.Joined the office of Justice Sri L.Narasimha Reddy garu (when he was an advocate) and thereafter, the office of her husband Sri Tangirala Hanumantha Reddy, Advocate to practice in various branches of law with main focus on civil, criminal, writs, cooperative matters and consumer disputes till February, 2005. Served as Standing Counsel for Central Government in the Central Administrative Tribunal (CAT), Hyderabad Bench as well as the High Court of Andhra Pradesh. Had been Standing Counsel for the Oriental Insurance Company in the High Court of Andhra Pradesh.Joined Income Tax Appellate Tribunal (ITAT) as a Judicial Member in the year 2005 and served in Bombay Benches from 2005 to 2010, in Bangalore  Benches from 2010 till 2015 and thereafter, in Hyderabad Benches from 2015 till 14.10.2021, Rendered various judgments on domestic and international taxation and also on transfer pricing issues.Was elevated to the Bench as Permanent Judge, High Court for the State  of Telangana and assumed charge as such on 15.10.2021.",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=3219"
    },
    {
        "name": "HONOURABLE SRI JUSTICE K.SURENDER",
        "description": "Honourable Sri Justice K.Surender was born on 11.01.1968 to Sri K.Laxminarayana and Smt.K.Pramila Devi at Mahaboobnagar, Telangana State. Sri K.Laxminarayana worked as Engineer in Electricity Department and mother is home-maker. He has done his schooling from Hyderabad Public School, Ramanthapur, Hyderabad.  Completed Graduation in Geology from Osmania University.  Later joined law and on completion of Law Graduation from Padala Rama Reddy Law Collee, enrolled himself as an Advocate with the Bar Council of erstwhile State of Andhra Pradesh in the year 1992.  Joined in the office of Senior Counsel Sri P.Sitapati, a prominent Criminal Lawyer.  Started independent practice from the month of May 1997. His Lordship practiced extensively on criminal, civil and constitutional side both in the High Court as well as in the lower Courts in the erstwhile State of Andhra Pradesh.  His Lordship was appointed as Assistant Additional Standing Counsel for Central Government in the High Court of Andhra Pradesh in the year 2005 till 2008.  He was appointed as Senior counsel for Central Bureau of Investigation (CBI) to prosecute Satyam Ramalingam Raju case in the year 2009. He was also appointed to the High Court as Standing Counsel and Special Public Prosecutor for CBI in the year 2010.  Appointed as Special Senior Counsel to argue the cases of Y.S.Jaganmohan Reddy in the year 2012. He was again appointed as Special Pubic Prosecutor for CBI Cases in the year 2013, 2017 and 2020 for the 4th time and continued till his elevation. He was also appointed as Special Counsel for NIA to prosecute the 2013 Dilsukhnagar Blast case. Also appointed by the Counter Intelligence, State of Telangana for prosecuting the Lumbini Park, Gokul Chat Bomb Blast cases. Successfully prosecuted and capital punishment was awarded in all the terror related cases. All the accused in Satyam Scam were also convicted. The trial in Satyam Scam was concluded in six months, Dilsukhnagar Blast case in four months and Lumbini Park, Gokul Chat cases in six months.  Gained experience in economic offence laws and anti-corruption laws. His Lordship was also appointed as Special Counsel for Enforcement Directorate in the year 2020.  His Lordship was elevated as permanent Judge of High Court for the State of Telangana on 24.03.2022. His wife Smt.K.Shanti is a home-maker. His Lordship blessed with two sons Hemanth, working as Software Engineer in Canada and Siddharth, pursuing Law.QQ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1022"
    },
    {
        "name": "HONOURABLE MRS. JUSTICE SUREPALLI NANDA",
        "description": "Born on 4th April, 1969 to late Dr Bollarum Danappa, who worked as Government Doctor specialized in Opthalmology and late  Smt.Bollarum Meera at Gowlipura, Old City, Hyderabad. Passed SSC in 1st Division from Holy Mary High School, Saifabad in the year 1984, Intermediate in first division in Bi.P.C in the year 1986 from Sarojini Naidu Vanita Maha Vidyalaya, Exhibition Ground, Hyderabad, BA (English literature) from Osmania University in the year 1990 and LL.B (special) degree from Vunki Sanna Rudrappa Law College(VSR Law College) then affiliated to Gulbarga University in the year 1993. Married to Sri Surepalli Madhava Rao, who is a retired District and Sessions Judge and currently practising Advocate in A.P. High Court. Blessed with a son Dr Surepalli Prashanth, who is a medical graduate and a law graduate (MBBS,LL.B,LL.M) and who is also currently practising Advocate in A.P. High Court. Enrolled as an Advocate on the rolls of Bar Council of Andhra Pradesh on 04-08-1993. After enrollment as an advocate, joined the Office of Honble Justice G Chandraiah garu(as advocate as he then was ) and worked in the said office for about a year. Later worked as a Junior Counsel assisting V.Rajagopal Reddy garu, Senior Advocate for the period 1994-2000. Actively practised for the last more than 28 years at the High Court of Judicature at Hyderabad and dealt with all types of constitutional, Civil, Criminal, Labour, Revenue, Service matters Specialized in the area of Constitutional Law (Writs).",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1023"
    },
    {
        "name": "HONOURABLE SMT. JUSTICE JUVVADI SRIDEVI",
        "description": "Born on 10th August, 1972 to Smt. Juvvadi Bharathi and Sri Juvvadi Surya Rao. She hails from Thimmapur Village, Jagtial District. Did her schooling from St.Anns High School, Bollaram and Sri Aurobindo International School, Hyderabad. Obtained Bachelor of Arts degree from Osmania University. Completed law in the year 1996 from Law College, Nanded, affiliated to Dr. Babasaheb Ambedkar Marathwada University. After enrollment as an advocate with the Bar Council of the erstwhile State of Andhra Pradesh in the year 1996, joined the office of Sri N.Pratap Reddy at Nirmal. Appointed as Additional Public Prosecutor at Assistant Sessions Court, Nirmal and served as such from 31.10.2004 to 10.02.2008. Thereafter, shifted practice to High Court and joined the office of Sri P. Lakshma Reddy. Her Lordship gained experience in various laws including revenue, municipal, service and criminal law. Appointed and served as Government Pleader for Land Acquisition and Government Pleader for Endowments during the year 2014 to 2017. Appointed as Additional Public Prosecutor at High Court for the State of Telangana on 24.01.2018 and served in the said capacity till the elevation. Elevated and sworn in as a Judge of High Court for the State of Telangana on 24.03.2022",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1025"
    },
    {
        "name": "HONOURABLE SRI JUSTICE NATCHARAJU SHRAVAN KUMAR VENKAT",
        "description": "Born on August 18th 1967 in an Agricultural family to late Shri. Natcharaju Venkat Kishan Rao and Smt. Natcharaju Sharada Devi, (Eldest daughter of Late. P.V.Narasimha Rao, Former Prime Minister of India). His Lordship did his Schooling from St. Pauls High School, Hyderguda, Hyderabad, Intermediate from Nrupatunga Junior College, Kachiguda, Hyderebad, Graduation in Commerce from Pragati Mahavidyalalya, Osmania University and M.B.A from Birla Institute of Technology, Mesra, Ranchi. His lordship obtained law degree from Pendekanti Law College, Osmania University and obtained P.G. Diploma in Cyber Laws from Nalsar University, Hyderabad. His Lordship enrolled as an Advocate in 2005 in the composite Bar Council of Andhra Pradesh. His Lordship joined the Office of Rao and Co. Lawyers, Hyderabad.29 and practiced in City Civil Courts Hyderabad and later joined the office of Shri.Challa Kodandaram (who became the Judge of the then High Court of Andhra Pradesh) and practiced extensively in Tax Laws, Company Law and before National Company Law Tribunal, Hyderabad. His Lordship was appointed as Govt. Pleader, Irrigation and CAD, Govt. of Telangana, in the year 2017 and continued till his elevation as Judge of the High Court for the State of Telangana and sworn-in on 24-03-2022. Married to Smt. N .Kavitha, Advocate and blessed with two daughters Ms. Madhurima working as Software developer in Amazon Development Center India Pvt. Ltd Hyderabd and Ms. Madhuvani pursuing Bachelors of law. ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1026"
    },
    {
        "name": "HONOURABLE SMT. JUSTICE MATURI GIRIJA PRIYADARSINI",
        "description": "    Born on 30 th August, to Sri. Maturi Appa Rao, who worked as Commercial Tax Officer in Telangana region and Smt.Nagaratnam. Soon after Intermediate her ladyship got married to Dr. K. Vijay Kumar and blessed with two sons, Nikhil and Akhil. Her Ladyship pursued Master of Arts in Sociology, Master of Arts in Public Administration and Master of Arts in Political Science from Andra University. Later, her Ladyship did her 3 years law course from N.B.M Law college, Visakhapatnam in the year 1995. Did her post graduation in law (L.L.M) from Andhra University in the year 1997. Her Ladyship stood first in Constitutional Law by securing highest marks. Enrolled as an Advocate on the rolls of Bar Council of Andhra Pradesh on September 1995. After enrollment as an advocate, joined the Office of Smt. P. Uma Bala and worked in the said office for about 7 years. Her Ladyship actively practiced for more than 10 years at Vishakhapatnam and dealt with all types of cases in Civil, Criminal, Labour law and Matrimonial matters and actively appeared in pro-bono cases referred by the District Legal Services Authority of Vishakhapatnam.Later Selected as District Judge by direct recruitment and joined judicial service as Addl. District Judge on 03-11-2008. Worked at various places of the then combined State of AP. Worked as Prl. District Judge, Ongole from August, 2016 to December 2018, Adilabad from January 2019 to October 2020 and Karimnagar from October 2020 to March 2022. During her tenure as Prl. District Judge in Prakasham and Adilabad District of the then composite State of AP, the District Legal Service Authority stood first continuously for 3 terms, during the period 2016-2019 for being best district legal service authority by National Legal Service Authority. NALSA in its 21st Episode of Akele Nahin Hain Aaap program telecasted by Doordarshan appreciated her ladyship for the efforts of District Legal Service Authority in conducting various legal aid programs in remote villages of the state with an objective to extend legal aid and to provide free and competent legal services to the weaker sections of the society. Elevated and sworn in as a Judge of High Court for the State of Telangana on 24-3-2022.",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1028"
    },
    {
        "name": "HONOURABLE SRI JUSTICE SAMBASIVARAO NAIDU",
        "description": "Born on 1st August, 1962 at Ramachandrapuram, East Godavari, to late Smt. Suryavathi and late Sri Satyanarayana. Did his schooling up to Intermediate from Ramachandrapuram. After graduating from SKBR College, Amalapuram, he obtained his B.L. degree from Andhra University in 1986. Married to Smt. Suryavani Naidu. Blessed with two children (1) Sri Srinesh Naidu, working as Senior Scientist, MSN Pharmaceuticals, New Jersey, USA, and (2) Sri Saikiran Naidu, working as Senior Software Engineer at Fidelity Investments located at Durham, North Carolina, USA and both are married. Started his practice as Advocate by joining in the office of Sri Pilla Janaki Ramayya at his native place Ramachandrapuram. He did his LL.M. from Kakatiya University, Warangal during 2004. He was selected as District Munsif on 1st May, 1991, and worked at various places, promoted as Senior Civil Judge in 2003 and as District Judge, Fast Track Court during 2010 and Regular District Judge in 2013. Worked as District Judge at Mahabubnagar, Ranga Reddy, City Civil Courts and Metropolitan Sessions Judge Court, Nampally, Hyderabad, Chairman Industrial Tribunal, Godavarikani, and before elevation he was also working as Principal Special Judge for ACB Cases, Hyderabad. He is interested in music, electronics and reading books. Appointed as Judge of the High Court for the State of Telangana, Hyderabad and assumed charge on 24-03-2022.",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1029"
    },
    {
        "name": "HONOURABLE SRI JUSTICE CHADA VIJAYA BHASKAR REDDY",
        "description": "Honourable Sri Justice Chada Vijaya Bhaskar Reddy (better known as C.V.Bhaskar Reddy), born on 28.06.1968 in an agricultural family in Dubbak, erstwhile Medak District.  His Lordship did schooling from Primary School, Dubbak, and Zilla Parishad High School, Dubbak, Intermediate from G. Pulla Reddy Junior College, Graduation in Science from Science College, Hyderabad, and Law Degree from Padala Rami Reddy Law College, Osmania University, Hyderabad.  His Lordship enrolled as an Advocate on 31.12.1992 in the composite Bar Council of Andhra Pradesh and joined as a Junior in the office of  Sri Justice V.V.S. Rao, the then Senior Advocate of the High Court of Andhra Pradesh, and continued up to the year 1999.  His Lordship was the Standing Counsel for National Institute of Rural Development (NIRD), Andhra Pradesh Small Scale Industries Development Corporation, Greater Warangal Municipal Corporation and was the Additional Standing Counsel for Central Government.  His Lordship was the Government Pleader for Revenue (General) and Assignment, State of Telangana, from 28.08.2014 till his elevation as a Judge of the High Court of Telangana on 04.08.2022.  Married to Smt. Vinoda Reddy and blessed with a son Mr. Abhilash Reddy and a daughter Ms. Akshitha Reddy. ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1032"
    },
    {
        "name": "HONOURABLE SRI JUSTICE E.V. VENUGOPAL",
        "description": "Mr. E.V.VENUGOPAL  @ Enugula venkata Venugopal was born on 16.08.1967 in karimnagar to Sri E.V.Rajeshwara Rao, who was Deputy Director of Handloom and Textiles and Smt. E.V.Blakumari, who worked as Govt. Teacher in the erstwhile State of Andhra Pradesh. He Has three brothers and one Sister.Got married to Dr. E.V SRIDEVI, MBBS, MS, Ophthalmologist and blessed with one daughter Ms E.V Rishitta , and one son Mr E.V.Aryan Sai. Completed Graduation in Arts and LL.B from Osmania University in 1992.Practiced Law in different branches for few years in Karimnagar as well as in the Erstwhile High Court of Andhra Pradesh before he joined as Junior Colleague of Shri Ram Jethmalani, Senior Advocate, Supreme Court and assisted him for long years in criminal and constitutional law before the Supreme Court and other High Courts throughout the country. Served as Central Government Standing Counsel from 2007 to 2013 before the Erstwhile High Court of Andhra Pradesh and handled writ petitions and writ appeals in various branches of law.Appointed as Railways Standing Counsel before Erstwhile High Court of Andhra Pradesh and continued to practice before High Court of Telangana after its bifurcation in other branches of law as well.Designated as Senior Advocate by the Honourable High Court of Telangana in the Year 2021.Put in more than 28 years of legal practice and gained expertise in Criminal, Civil, Commercial, Public and private international law apart from constitutional Law.Elevated as Judge of the High Court for the State of Telangana at Hyderabad and sworn-in on 16.08.2022. ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1033"
    },
    {
        "name": "HONOURABLE SRI JUSTICE NAGESH BHEEMAPAKA",
        "description": "Born to Sri Bheemapaka Bhupathi Rao and Smt. Shanthamma at Bhadrachalam, Khammam District on 08.03.1969.  Schooled at Government High School and Little Flower High School, Bhadrachalam.  Intermediate at Dr.Jaya Chandra Reddy Junior College, Khammam. Obtained Law Degree from C.R.Reddy Law College, Eluru and L.L.M. (International Law) from O.U.P.G Law College, Basheerbagh, Hyderabad.  Enrolled as an Advocate on 21.4.1993.  Joined Chambers of Sri M.V. Ramana Rao at Bhadrachalam to commence Law practice and mastered in Civil, Criminal and Agency laws. Joined the Office of Sri C. Damodhar Reddy at the erstwhile High Court of Andhra Pradesh in 1996. Appointed as Assistant Government Pleader in 2004 for Municipal Administration, Finance and Planning, Housing, Stamps and Registration.   Appointed as Standing Counsel for the G.H.M.C. and continued upto 2014 till got appointed as Government Pleader for Industries, Commerce and Mines.  Started independent practice from 2017 and again appointed as Government Pleader for Medical, Health, Family Welfare, Minority Welfare, BC Welfare, Tribal Welfare, S.C.Welfare, Animal Husbandry, Fisheries, Land Grabbing.  Sworn in as a permanent Judge of the High Court for the State of Telangana on 16-08-2022.Married to Smt. B.Radha Parameswari in 2000 and blessed with Manaswi Bheemapaka and Varshith Bheemapaka.",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1034"
    },
    {
        "name": "HONOURABLE SRI JUSTICE PULLA KARTHIK",
        "description": "Honourable Sri Justice Pulla Karthik was born in erstwhile Jagtial Town of Karimnagar District to late Sri Pulla Voggu Hanumanthu and late Smt. Pocha Mallamma. Completed schooling at Government Upper Primary School, Kothawada at ,Jagtial. His Lordship did his Intermediate and Graduation from Sri Kasuganti Narayana Rao Government Arts and Science College, Jagtial. Did Post Graduation in Political Science in the year 1992 in University College of Arts and Social Sciences, Osmania University, obtained Law Degree from Osmania University College of Law, Hyderabad in the year 1995. Also completed L.L.M. in Constitutional Law in P.G. College of Law, Osmania University, Hyderabad, in the year 1997.Enrolled as a member on the rolls of Bar Council of erstwhile Andhra Pradesh, Hyderabad, in March, 1996 and practiced till 2014 in various branches of Law, extensively in service matters. Served as Government Pleader in Andhra Pradesh Administrative Tribunal, Hyderabad from March, 2015 till September, 2016. Also served as Government Pleader for Services-I in erstwhile High Court of Judicature at Hyderabad from 2017 till elevation. Elevated to the Bench as Permanent Judge, High Court for the State of Telangana, and assumed charge as such on 16.08.2022. ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1035"
    },
    {
        "name": "HONOURABLE SRI JUSTICE K.SARATH",
        "description": "Sri Justice Kaja Sarath was born to late Seeta Ramaiah and late Smt. Lalithambha on 29th January, 1971 at Bhadrachalam, Bhadradri Kothagudem District.  Got married to Smt. Madhavi and blessed with only son Sreesanth. He completed his Schooling at Government High School, Intermediate at Government Junior College and B.Sc. (M.P.C.) at Government Degree College in Bhadrachalam Town. He completed M.A. from Arts College in Osmania University Campus, Hyderabad. He completed B.L. from Law College in Andhra University Campus, Vishakhapatnam and L.L.M. in Constitutional Law from P.G. College of Law, Osmania University, Hyderabad. He enrolled as an Advocate on 31.12.1997. Initially he practiced in Trial Courts at Kothagudem and Bhadrachalam. Thereafter, shifted his practice to High Court, Hyderabad  in the year, 2002 and joined in the Chambers of Sri. P.V.Ramana, Advocate. Subsequently he developed independent practice in the combined High Court of AP and erstwhile A.P. Administrative Tribunal. He continued his practice in the High Court for the State of Telangana after bifurcation of the High Court.While practicing, he was dealing in matters relating to various branches of law like Writ Petitions, Civil Revisions, Appeal Suits, Motor Accidents Appeals, Arbitration, Bails, Criminal Revisions and Criminal Petitions.He has been appointed as a Judge of High Court for the State of Telangana and assumed charge as such on 16.08.2022.",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1036"
    },
    {
        "name": "HONOURABLE SRI JUSTICE J SREENIVAS RAO",
        "description": "Justice Sri Jaggannagari Sreenivas Rao was born on 31.08.1969 in an agricultural family of Lingannapet (V), Gambhiraopet (M), Rajanna-Siricilla District, (erstwhile Karimnagar District) to Sri J. Manikya Rao and late Smt. J. Lakshmi Bai.  His Lordship has completed school education at Zilla Parishad High School, Lingannapet, Intermediate from Govt. Junior College, Gambhiraopet and Graduation from Bhavans New Science College, Narayanguda, Hyderabad and Law Degree from Osmania University.  After completing Law Degree, he was enrolled as an Advocate in the year 1999 and joined the Chambers of Sri G. Krishna Murthy, Advocate. His Lordship started independent practice in January 2006. While practicing, his Lordship dealt with Writs (Service and Non-Service), Civil, Criminal matters and Arbitration before the erstwhile High Court for the State of Andhra Pradesh, Hyderabad, High Court for the State of Telangana as well as in Lower Courts and Tribunals in and around twin cities.He was appointed as Standing Counsel for Singareni Collieries Company Ltd., in April 2015 and continued till his elevation.  He got married to J.Sreelatha and was blessed with a son Mr. Praneeth and a daughter Ms. Prakshiptha.He has been elevated as Additional Judge, for the High Court of the State of Telangana, and was sworn in, in the forenoon of 16th of August, 2022.",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1037"
    },
    {
        "name": "HONOURABLE SRI JUSTICE NAMAVARAPU RAJESHWAR RAO",
        "description": "Honourable Justice Namavarapu RajeshwarRao born to late Namavarapu Satayanarayana Rao and late Smt. Girijakumari on 30th June 1969 in an agricultural family at Sudhanpally, erstwhile Warangal District, presently comes under Kuravimandal, Mahabubabad District.  He married Smt.Padmavathi and blessed with  daughter NVSS ANANYA. He has two brothers and five sisters.He completed his School Education in Saraswathi Sisumandir, Mahabubia High Schoolat Warangal town and in Government Junior College at Mulugu of Warangal District. Studied Intermediate at Govindaraopet of Warangal district. B.Com. at Government Degree College, Mahabubabad, erstwhile Warangal district.He completed his LL.B., at Pendekate Law College of Osmania University, Hyderabad. He did Post Graduate Diploma in Communication in Journalism(PGDCJ) at Rachana Journalism College, Hyderabad.He enrolled as an Advocate on 20.02.2001., joined in the office of Justice Sri C.V.Ramulu, the then Senior Central Government Standing Counsel of erstwhile Andhra Pradesh High Court. Later, started his practice as an independent Advocate in the High Court of Andhra Pradesh in the combined State. Earlier served in the High Court of Telangana as Central Government Standing Counsel, panel Advocate of Serious Fraud Investigation Office(SFIO), Armed Forces Tribunal(AFT) and University Grants Commission (UGC).Subsequently, appointed as an Assistant Solicitor General of  India in the High Court of Telangana, Hyderabad, in the year of 2019and served till his elevation.He has been appointed as an Additional Judge, High Court for the State of Telangana and assumed charge on 16thAugust 2022.  ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1038"
    },
    {
        "name": "HONOURABLE SRI JUSTICE LAXMI NARAYANA ALISHETTY",
        "description": "His Lordship born on 13.05.1968 in Mendora village of Nizamabad District to Sri A.Gangadhar and late Smt. Raju Bai. Completed S.S.C. from Z.P.H.S. Mupkal, Intermediate from Government Junior College, Nizamabad, and Degree (B.Sc.) from Giriraj Government Decree College, Nizamabad. Obtained Law Degree from Kakatiya University, Warangal in 1992, Bachelor of Library and Information Science (B.Li.Sc) from Osmania University in 1993.Married to Kavitha Vahini and blessed with son Mr. Kushal Krishna and daughter Ms. Laasya.Enrolled as an Advocate on 27.01.1994 and practiced on Original and Appellate Courts. His Lordship was regular practitioner at High Court of Telangana as well as High Court of Andhra Pradesh and dealt matters on Constitutional, Arbitration, Commercial litigation, Land Litigation, Land Acquisition, Revenue, Food Adulteration etc. His Lordship was advisor and handling matters of various Institutions including Public Sector Undertakings, i.e. National Highway Authority of India (NHAI), NBCC (India) Ltd. Ms.Hindustan Steel Works Const. Ltd. LIC Housing Finance Limited, Ms.Oriental Insurance Company Limited, Industrial Development Bank of India (IDBI), apart from Multi-National Companies, Banks, NBFCs, Real Estate Companies, Seed Companies, Fertilizer Companies etc.His Lordship was appointed as Additional Judge for the High Court of the State of Telangana and was sworn-in on 31.07.2023. ",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1044"
    },
    {
        "name": "HONOURABLE SRI JUSTICE ANIL KUMAR JUKANTI",
        "description": "Born on 28th of December, 1971 to Jukanti Lakshmi Bai and Jukanti Veera Basappa. Married to K. Hima Bindu and blessed with daughters J.Akshitha, J.Harsha Vallika and son J.Lakshmi Veera Venkatesh. Native of Vill. Mangalpet, Taluq-Mandal. Narayankhed, Dist. Sangareddy.Has A Bachelors Degree in Electronics and Tele Communication Engineering, A Degree in Bachelor of Law and A Masters in Mercantile Law, Post Graduate Diploma in Alternate Dispute Resolution. Enrolled as an Advocate on 14th of November, 2002.Practiced in Civil, Criminal, Constitutional, Taxation and Service matters in the High Court.Attached to office of O.Manoher Reddy from December, 2002 to March, 2010. Was a Government Junior Standing Counsel for Commercial Taxes for State from April, 2010 till August, 2014. Was Government Special Standing Counsel for Commercial taxes for State from August, 2014 till June, 2021.Was Advocate on Record to represent High Court and District Judiciary in Judicial Matters in High Court from April, 2013 till July, 2023.Was Standing Counsel to represent State Legal Services Authority, High Court Legal Services Committee, District Legal Services Authorities, Mandal Legal Services Committees and Permanent Lok Adalats for Public Utility Services in High Court from March, 2014 till July, 2023.Appointed as Additional Judge of The High Court for The State of Telangana, Sworn in on 31st July, 2023.",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1045"
    },
    {
        "name": "HONOURABLE SMT JUSTICE SUJANA KALASIKAM",
        "description": "Was born on 10thMarch 1970 to Sri Madhusudan and Smt. Pramila in Aleru, the then combined district of Nalgonda. She is married to Sri Shankar, an Advocate hailing from Ghatkesar, and is blessed with two sons. She completed her Intermediate in Aleru and graduated from Osmania University. In 1997, she graduated in Law and enrolled as an Advocate in the Bar Council. In her illustrious career as a Judicial Officer, she has served the State Judiciary in various capacitiesSelected as Junior Civil Judge in 2010 While working as Junior Civil Judge, was selected as District Judge in 2012 Served as Additional District Judge at Karimnagar DistrictServed as Principal District and Sessions Judge, Nizamabad District Worked as Chief Judge, Small Causes Court in Hyderabad Worked as Director of the Telangana State Judicial Academy, Secunderabad Held the position of Registrar (Administration) and then the position of Registrar General of the High Court for the State of Telangana. Was elevated as an Additional Judge of the High Court for the State of Telangana and assumed charge as such on 31.07.2023.",
        "imgUrl": "https://tshc.gov.in/judgeImageView.action?judgetype=P&cjornot=Y&judcode=1046"
    }
]